// Если вы ответвились от ветки lesson_17 то и пул реквест делаем в lesson_17

// 1:
// Корректные названия переменных
// 2: 

// if (height > width) {
//     console.log("Наибольшее число:", height);
// } else if (width > height) { //все ок но лучше не // } else if (width > height) {, а // } else if (height < width) {, что бы везде было "height ... width"
//     console.log("Наибольшее число:", width);
// } else {
//     console.log("Числа равны");
// }

// Продвинутый:
// 1. Молодец, но в конце не восклицательного знака, а если бы был то ты бы увидел лишний пробел в конце
// 2. Формула в виде строки, грубо говоря чтоб в консли было так '(((6 - 10) + 5) * 20) / 2 = 10', как мы делали вывод составных строк
// 3. Можно проще 
// let result = '';

// for (let i = 0; i < 6; i++) {
//     result += '#'
//     console.log(result);
// }
