// нэйминг переменных 
// const XbuttonandData = document.createElement('div');
// можно что-нить вроде closeButton или типа того

// .button3 {} - тоже называть как и блоки
// .wrapper_down__SomeText{
// .DateText{

// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
// * {
//     margin: 0;
//     padding: 0;
//     box-sizing: border-box;
// }
// Лучше переопределение всех стилей размещать в самом верху стилей (если у нас один файл)

// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
// .item input[type=checkbox]
// .item .date-btn

// Такие селекторы без реальной неообходимости лучше не юзать 
// так как они увеличивают специфичность и их потом может быть тяжелее переопределять

// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

// box-shadow: 0 2px 4px rgba(0, 0, 0, 0.1);
// background-color: #0056b3;

// если в в рамках своего проекта начали везде цвета добавлять через 
// rgba(0, 0, 0, 0.1) то везде делайте так, 
// если #0056b3 то так везде
// Лучше делать везде #0056b3

// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

// Правила форматирования стидей
// https://learn.javascript.ru/css-format

// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!


// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!